In [25]:
import pandas as pd
import geopandas as gpd
from keplergl import KeplerGl

import sys
import os
import glob
sys.path.append('../../src')
import cargadata as cdat

In [26]:
df = pd.read_csv("../Input/df8_d_.csv")

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102336 entries, 0 to 102335
Data columns (total 5 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   index     102336 non-null  object
 1   variable  102336 non-null  int64
 2   value     101061 non-null  float64
 3   lat       102336 non-null  float64
 4   lon       102336 non-null  float64
dtypes: float64(3), int64(1), object(1)
memory usage: 3.9+ MB

In [22]:
df.head()

        index  variable      value        lat       lon
0  2016-01-01  28079004  39.695652  40.423882 -3.712257
1  2016-01-02  28079004  26.416667  40.423882 -3.712257
2  2016-01-03  28079004  34.083333  40.423882 -3.712257
3  2016-01-04  28079004  17.583333  40.423882 -3.712257
4  2016-01-05  28079004  29.291667  40.423882 -3.712257

In [28]:
df.rename({'index':'fecha'}, axis=1, inplace=True)

In [29]:
df

             fecha  variable      value        lat       lon
0       2016-01-01  28079004  39.695652  40.423882 -3.712257
1       2016-01-02  28079004  26.416667  40.423882 -3.712257
2       2016-01-03  28079004  34.083333  40.423882 -3.712257
3       2016-01-04  28079004  17.583333  40.423882 -3.712257
4       2016-01-05  28079004  29.291667  40.423882 -3.712257
...            ...       ...        ...        ...       ...
102331  2021-10-28  28120001   8.750000  40.825111 -3.961194
102332  2021-10-29  28120001   1.833333  40.825111 -3.961194
102333  2021-10-30  28120001   1.041667  40.825111 -3.961194
102334  2021-10-31  28120001   1.000000  40.825111 -3.961194
102335  2021-11-01  28120001   1.000000  40.825111 -3.961194

[102336 rows x 5 columns]

In [31]:
df.fecha = pd.to_datetime(df.fecha)
#df = df.asfreq('D')

In [32]:
df.head()

       fecha  variable      value        lat       lon
0 2016-01-01  28079004  39.695652  40.423882 -3.712257
1 2016-01-02  28079004  26.416667  40.423882 -3.712257
2 2016-01-03  28079004  34.083333  40.423882 -3.712257
3 2016-01-04  28079004  17.583333  40.423882 -3.712257
4 2016-01-05  28079004  29.291667  40.423882 -3.712257

In [37]:
df.fecha

0        2016-01-01
1        2016-01-02
2        2016-01-03
3        2016-01-04
4        2016-01-05
            ...
102331   2021-10-28
102332   2021-10-29
102333   2021-10-30
102334   2021-10-31
102335   2021-11-01
Name: fecha, Length: 102336, dtype: datetime64[ns]

In [38]:
df.dtypes

fecha       datetime64[ns]
variable             int64
value              float64
lat                float64
lon                float64
dtype: object

In [39]:
#Create a basemap 
map_1= KeplerGl(height=700, weight = 500, data={'value': df})
#show the map
map_1

User Guide: https://docs.kepler.gl/docs/keplergl-jupyter

KeplerGl(data={'value':             fecha  variable      value        lat       lon
0      2016-01-01  2807900â€¦

/usr/local/lib/python3.8/dist-packages/jupyter_client/session.py:716: UserWarning: Message serialization failed with:
Out of range float values are not JSON compliant
Supporting this message is deprecated in jupyter-client 7, please make sure your message is JSON-compliant
  content = self.pack(content)

In [40]:
config = map_1.config

In [12]:
config

{}